# Example 2

CASE 2

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# The CASE statement goes through conditions and returns a value when the first condition is met (like an if-then-else statement). 
# So, once a condition is true, it will stop reading and return the result. If no conditions are true, it returns the value in the ELSE clause.
# If there is no ELSE part and no conditions are true, it returns NULL.
query = '''
            SELECT CustomerName, City, Country 
            FROM Customers
            ORDER BY   (CASE
                            WHEN City IS NULL THEN Country
                            ELSE City
                        END)
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df.head()

                 CustomerName          City    Country
0   Drachenblut Delikatessend        Aachen    Germany
1  Rattlesnake Canyon Grocery   Albuquerque        USA
2      Old World Delicatessen     Anchorage        USA
3      Galería del gastrónomo     Barcelona      Spain
4           LILA-Supermercado  Barquisimeto  Venezuela

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerName  91 non-null     object
 1   City          91 non-null     object
 2   Country       91 non-null     object
dtypes: object(3)
memory usage: 2.3+ KB

## Close the connection

In [6]:
con.close()